<h1>PANDAS</h1>

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

C:\Users\LEGOIN\AppData\Roaming\Python\Python38\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\LEGOIN\AppData\Roaming\Python\Python38\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
C:\Users\LEGOIN\AppData\Roaming\Python\Python38\site-packages\numpy\.libs\libopenblas.XWYDX2IKJW2NMTWSFYNGFUWKQU3LYTCZ.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

<h1>pandas series</h1>

In [2]:
labels= ['a','b','c']
mydata= [10,20,30]
d = {'a':10 , 'b':20 , 'c':30} #dectionary
arr = np.array(mydata)
arr

array([10, 20, 30])

In [3]:
pd.Series(data= mydata)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(mydata,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)# same for numpy array

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [7]:
x=  pd.Series(data= [sum ,print,len])# it can stor also functions
x

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
x[1]("jer")

jer

In [9]:


ser1 = pd.Series([1,2,3,4],["USA","Germany","USSR","Japan"])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2= pd.Series([1,2,5,4],["USA","Germany","Italy","Japan"])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser3 = pd.Series(data= labels)
ser3[0]

'a'

In [13]:
ser1 + ser2 # we can also do mathematic functions on pandas

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

<h1>Pandas DataFrams - part 1</h1>

In [14]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','x','y','z'])

In [16]:
df

          W         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
df[['x','y']]

          x         y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [20]:
df['new']= df['W']+df['y']

In [21]:
df

          W         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df.drop('x',axis=1,inplace=True)

In [23]:
df

          W         y         z       new
A  2.706850  0.907969  0.503826  3.614819
B  0.651118 -0.848077  0.605965 -0.196959
C -2.018168  0.528813 -0.589001 -1.489355
D  0.188695 -0.933237  0.955057 -0.744542
E  0.190794  2.605967  0.683509  2.796762

In [24]:
df.drop('E')

          W         y         z       new
A  2.706850  0.907969  0.503826  3.614819
B  0.651118 -0.848077  0.605965 -0.196959
C -2.018168  0.528813 -0.589001 -1.489355
D  0.188695 -0.933237  0.955057 -0.744542

In [25]:
df.shape

(5, 4)

In [26]:
df[['W','y']]

          W         y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [27]:
df.loc['A']

W      2.706850
y      0.907969
z      0.503826
new    3.614819
Name: A, dtype: float64

In [28]:
#int only index function
df.iloc[1]

W      0.651118
y     -0.848077
z      0.605965
new   -0.196959
Name: B, dtype: float64

In [29]:
df.loc['B','W']

0.6511179479432686

In [30]:
df.loc[['A','B'],['W','y']]

          W         y
A  2.706850  0.907969
B  0.651118 -0.848077

<h1>Pandas conditinal
    Selection - part 2</h1>

In [31]:
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','x','Y',"z"])
df

          W         x         Y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
 booldf= df > 0
 booldf

       W      x      Y      z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
df[booldf]

          W         x         Y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [36]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [37]:
#filter rows it
'''
A     True
B     True
C    False it will not return c becouse of false
D     True
E     True
'''
df[df['W']>0]

          W         x         Y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

<h3>i want  to grab all the rows where Z is less than ZERO</h3>

In [38]:
df[df["z"]<0]

          W         x         Y         z
C -2.018168  0.740122  0.528813 -0.589001

<h3> i want to grab column x where column w is less than ZERO</h3>

In [39]:
df[df['W']>0]["x"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [40]:
boolser = df['W']>0
resualt= df[boolser]
mycols = ['x','Y']
resualt[mycols]

          x         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [41]:
df[(df['W']>0) | (df['Y']>1)]

          W         x         Y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.reset_index()

  index         W         x         Y         z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

<h3>Add new column by string</h3>

In [43]:
newInd = 'CA NY WY OR CO'.split()# it will split automatic at spaces
df['New Column'] = newInd
df

          W         x         Y         z New Column
A  2.706850  0.628133  0.907969  0.503826         CA
B  0.651118 -0.319318 -0.848077  0.605965         NY
C -2.018168  0.740122  0.528813 -0.589001         WY
D  0.188695 -0.758872 -0.933237  0.955057         OR
E  0.190794  1.978757  2.605967  0.683509         CO

In [44]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

<h3>How to set column in the dataframe as index column
</h3>

In [45]:
df.set_index("New Column",inplace=True)

In [46]:
df

                   W         x         Y         z
New Column
CA          2.706850  0.628133  0.907969  0.503826
NY          0.651118 -0.319318 -0.848077  0.605965
WY         -2.018168  0.740122  0.528813 -0.589001
OR          0.188695 -0.758872 -0.933237  0.955057
CO          0.190794  1.978757  2.605967  0.683509

<h1>Pandas MULTI INDEX - Part 3</h1>

In [47]:
outside = ['G1','G1','G1','G2','G2','G2']
inside= [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))# zip function convert 2+ list to tuble list
type(hier_index[0])

tuple

In [48]:
hier_index= pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

<h3>how to make 2 levels of index ?</h3>

In [49]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [50]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [51]:
df.index.names

FrozenList([None, None])

<h3>change the index's  columns Name</h3>

In [52]:
df.index.names=  ['Group',"Num"]

In [53]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [54]:
df.xs("G1")

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

<h3>XS filtering tool</h3>

<h5>How to get Num one in every located group</h5>

In [55]:
df.xs(1,level="Num")#  select level of index by level=.... and the number you want to select

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

<h1>Pandas-Missing Data</h1>

In [56]:
dic={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(dic)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

<h3>drop any row or column with nan value</h3>

In [57]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [58]:
df.dropna(axis = 1)#All columns g=hava nan values

   C
0  1
1  2
2  3

In [59]:
df.dropna( thresh=3)#minimun amount of drop nan values

     A    B  C
0  1.0  5.0  1

<h3>how to replace Replace nan values</h3>

In [60]:
df.fillna(value= "Nan value")

           A          B  C
0        1.0        5.0  1
1        2.0  Nan value  2
2  Nan value  Nan value  3

In [61]:
df['A'].fillna(value = df['A'].mean())
# in numerical values we usualy replace nan value with the mean of it's columns

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<h1>Pandas group by</h1>

In [62]:
data = {'Company':['GOOG', 'GOOG','MSFT', 'MSFT','FB','FB'],
      "Person":['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [63]:
df=  pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

<h3>group by the company <br> do mathimatical functions on every company</h3>

In [64]:
myGroupedData =  df.groupby('Company')

In [65]:
myGroupedData.mean()
    # when we try to get the mean it search for the numerical value column
    # and get the mean of it

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
myGroupedData.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [67]:
myGroupedData.std() #standard daviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [68]:
myGroupedData.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

<h5>Get sum FB salaries  and max and min salary company<br>
   count the persons in the company
</h5>

In [69]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [70]:
df.groupby('Company').max() # her he get the max person salary in every company

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [71]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [72]:
df.groupby('Company').min() # her he get the min person salary in every company

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

<h5>Get All in one 
</h5>

In [73]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [74]:
df.groupby('Company').describe().transpose()# only shang shape

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [1]:
sss

NameError: name 'sss' is not defined